
BRANCH_NET_R-01 Interfaces IP Assigning
========================================

Router>en
Router#configuration terminal
Router(config)#hostname BRANCH_NET_R-01
BRANCH_NET_R-01(config)#interface gidabitEthernet 0/0
BRANCH_NET_R-01(config-if)#ip address 192.168.100.1 255.255.255.0
BRANCH_NET_R-01(config-if)#no shutdown
BRANCH_NET_R-01(config-if)#exit
BRANCH_NET_R-01(config)#interface gidabitEthernet 0/1
BRANCH_NET_R-01(config-if)#ip address 172.168.100.10 255.255.255.0
BRANCH_NET_R-01(config-if)#no shutdown
BRANCH_NET_R-01(config-if)#exit
BRANCH_NET_R-01(config)#interface serial 0/3/0
BRANCH_NET_R-01(config-if)#ip address 10.10.10.1 255.255.255.252
BRANCH_NET_R-01(config-if)#no shutdown
BRANCH_NET_R-01(config-if)#exit
BRANCH_NET_R-01(config)#interface gigabitethernet0/0
BRANCH_NET_R-01(config-if)#ip add 210.211.212.9 255.255.255.252
BRANCH_NET_R-01(config-if)#no shutdown
BRANCH_NET_R-01(config-if)#end
BRANCH_NET_R-01#wite memory